run/tutorials/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication -s air    decomposePar -region air
runApplication -s porous decomposePar -region porous

runParallel $(getApplication)

runApplication -s air    reconstructPar -latestTime -region air
runApplication -s porous reconstructPar -latestTime -region porous

#------------------------------------------------------------------------------
